u-blox/evb-ant-1/board/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v12.0
processor: MIMXRT1062xxxxA
package_id: MIMXRT1062DVL6A
mcu_data: ksdk2_0
processor_version: 12.0.1
pin_labels:
- {pin_num: E3, pin_signal: GPIO_EMC_00, label: NINA_CLK, identifier: SEMC_D0;NINA_CLK}
- {pin_num: F3, pin_signal: GPIO_EMC_01, label: NINA_CS, identifier: SEMC_D1;NINA_CS}
- {pin_num: F4, pin_signal: GPIO_EMC_02, label: NINA_MOSI, identifier: SEMC_D2;NINA_MOSI}
- {pin_num: F2, pin_signal: GPIO_EMC_04, label: MAYA_BT_W_H, identifier: SEMC_D4;MAYA_BT_W_H}
- {pin_num: G4, pin_signal: GPIO_EMC_03, label: NINA_MISO, identifier: SEMC_D3;NINA_MISO}
- {pin_num: C2, pin_signal: GPIO_EMC_09, label: MAYA_WLAN_W_D, identifier: SEMC_A0;MAYA_WLAN_W_D}
- {pin_num: A6, pin_signal: GPIO_EMC_13, label: NINA_TX, identifier: SEMC_A4;NINA_TX}
- {pin_num: B6, pin_signal: GPIO_EMC_14, label: NINA_RX, identifier: SEMC_A5;NINA_RX}
- {pin_num: B1, pin_signal: GPIO_EMC_15, label: NINA_CTS, identifier: SEMC_A6;NINA_CTS}
- {pin_num: A5, pin_signal: GPIO_EMC_16, label: NINA_RTS, identifier: SEMC_A7;NINA_RTS}
- {pin_num: A4, pin_signal: GPIO_EMC_17, label: NINA_GPIO1, identifier: SEMC_A8;NINA_GPIO1}
- {pin_num: B2, pin_signal: GPIO_EMC_18, label: MAYA_WLAN_RESET, identifier: SEMC_A9;MAYA_WLAN_RESET}
- {pin_num: B4, pin_signal: GPIO_EMC_19, label: NINA_GPIO3, identifier: SEMC_A11;NINA_GPIO3}
- {pin_num: A3, pin_signal: GPIO_EMC_20, label: NINA_GPIO2, identifier: SEMC_A12;NINA_GPIO2}
- {pin_num: C1, pin_signal: GPIO_EMC_21, label: MAYA_BT_W_D, identifier: SEMC_BA0;MAYA_BT_W_D}
- {pin_num: F1, pin_signal: GPIO_EMC_22, label: NINA_RST, identifier: SEMC_BA1;NINA_RST}
- {pin_num: D3, pin_signal: GPIO_EMC_24, label: NINA_SW1, identifier: SEMC_CAS;NINA_SW1}
- {pin_num: D2, pin_signal: GPIO_EMC_25, label: MAYA_TX, identifier: SEMC_RAS;MAYA_TX}
- {pin_num: B3, pin_signal: GPIO_EMC_26, label: MAYA_RX, identifier: SEMC_CLK;MAYA_RX}
- {pin_num: A2, pin_signal: GPIO_EMC_27, label: MAYA_BT_RESET, identifier: SEMC_CKE;MAYA_BT_RESET}
- {pin_num: D1, pin_signal: GPIO_EMC_28, label: MAYA_WLAN_W_H, identifier: SEMC_WE;MAYA_WLAN_W_H}
- {pin_num: E1, pin_signal: GPIO_EMC_29, label: MAYA_RTS, identifier: SEMC_CS0;MAYA_RTS}
- {pin_num: C6, pin_signal: GPIO_EMC_30, label: MAYA_CTS, identifier: SEMC_D8;MAYA_CTS}
- {pin_num: C5, pin_signal: GPIO_EMC_31, label: NINA_SW2, identifier: SEMC_D9;NINA_SW2}
- {pin_num: C4, pin_signal: GPIO_EMC_33, label: NINA_UART_MUX, identifier: SEMC_D11;SEL_MUX_AX_UART;NINA_UART_MUX}
- {pin_num: C3, pin_signal: GPIO_EMC_36, label: ANT_BXX_UART_MUX, identifier: SEMC_D14;SEL_MUX_AX;ANT_BXX_UART_MUX}
- {pin_num: A11, pin_signal: GPIO_B1_00, label: USER_LED_01, identifier: LCDIF_D12;USER_LED_02;USER_LED_01}
- {pin_num: B11, pin_signal: GPIO_B1_01, label: MCU_SW1, identifier: LCDIF_D13;MCU_SW1}
- {pin_num: C11, pin_signal: GPIO_B1_02, label: MCU_SW2, identifier: LCDIF_D14;MCU_SW2}
- {pin_num: D13, pin_signal: GPIO_B1_12, label: ANT_BXX_SW1, identifier: SD_CD_SW;ANT_BXX_SW1}
- {pin_num: C14, pin_signal: GPIO_B1_14, label: MCU_SW3, identifier: SD0_VSELECT;MCU_SW3}
- {pin_num: B14, pin_signal: GPIO_B1_15, label: USER_LED_02, identifier: BACKLIGHT_CTL;USER_LED_02}
- {pin_num: M14, pin_signal: GPIO_AD_B0_00, label: ANT_BXX_SW2, identifier: ANT_BXX_SW2}
- {pin_num: J11, pin_signal: GPIO_AD_B1_00, label: ANT_BXX_CTS, identifier: I2C_SCL_FXOS8700CQ;CSI_I2C_SCL;ANT_BXX_CTS}
- {pin_num: K11, pin_signal: GPIO_AD_B1_01, label: ANT_BXX_RTS, identifier: I2C_SDA_FXOS8700CQ;CSI_I2C_SDA;ANT_BXX_RTS}
- {pin_num: L11, pin_signal: GPIO_AD_B1_02, label: ANT_BXX_TX, identifier: SPDIF_OUT;ANT_BXX_TX}
- {pin_num: M12, pin_signal: GPIO_AD_B1_03, label: ANT_BXX_RX, identifier: SPDIF_IN;ANT_BXX_RX}
- {pin_num: H13, pin_signal: GPIO_AD_B1_08, label: ANT_BXX_GPIO3, identifier: CSI_D9;ANT_BXX_GPIO3}
- {pin_num: M13, pin_signal: GPIO_AD_B1_09, label: ANT_BXX_RST, identifier: CSI_D8;ANT_BXX_RST;ANT_BXX}
- {pin_num: L13, pin_signal: GPIO_AD_B1_10, label: ANT_BXX_GPIO1, identifier: CSI_D7;ANT_BXX_GPIO1}
- {pin_num: J13, pin_signal: GPIO_AD_B1_11, label: ANT_BXX_GPIO2, identifier: CSI_D6;ANT_BXX_GPIO2}
- {pin_num: H12, pin_signal: GPIO_AD_B1_12, label: ANT_BXX_CS, identifier: CSI_D5;ANT_BX_CS;ANT_BXX_CS}
- {pin_num: H11, pin_signal: GPIO_AD_B1_13, label: ANT_BXX_MISO, identifier: CSI_D4;ANT_BXX_MISO}
- {pin_num: G12, pin_signal: GPIO_AD_B1_14, label: ANT_BXX_MOSI, identifier: CSI_D3;ANT_BXX_MOSI}
- {pin_num: J14, pin_signal: GPIO_AD_B1_15, label: ANT_BXX_CLK, identifier: CSI_D2;ANT_BXX_CLK}
- {pin_num: L5, pin_signal: GPIO_SD_B1_00, label: MAYA_PDN, identifier: FlexSPI_D3_B;MAYA_PDN}
- {pin_num: L6, pin_signal: WAKEUP, label: USER_BUTTON, identifier: SD_PWREN;USER_BUTTON}
- {pin_num: L14, pin_signal: GPIO_AD_B0_13, label: UART1_RXD, identifier: UART1_RXD}
- {pin_num: K14, pin_signal: GPIO_AD_B0_12, label: UART1_TXD, identifier: UART1_TXD}
- {pin_num: A7, pin_signal: GPIO_EMC_40, label: ENET_MDC, identifier: ENET_MDC}
- {pin_num: C7, pin_signal: GPIO_EMC_41, label: ENET_MDIO, identifier: ENET_MDIO}
- {pin_num: B13, pin_signal: GPIO_B1_10, label: ENET_TX_CLK, identifier: ENET_TX_CLK}
- {pin_num: E12, pin_signal: GPIO_B1_04, label: ENET_RXD0, identifier: ENET_RXD0}
- {pin_num: D12, pin_signal: GPIO_B1_05, label: ENET_RXD1, identifier: ENET_RXD1}
- {pin_num: C12, pin_signal: GPIO_B1_06, label: ENET_CRS_DV, identifier: ENET_CRS_DV}
- {pin_num: C13, pin_signal: GPIO_B1_11, label: ENET_RXER, identifier: ENET_RXER}
- {pin_num: B12, pin_signal: GPIO_B1_07, label: ENET_TXD0, identifier: ENET_TXD0}
- {pin_num: A12, pin_signal: GPIO_B1_08, label: ENET_TXD1, identifier: ENET_TXD1}
- {pin_num: A13, pin_signal: GPIO_B1_09, label: ENET_TXEN, identifier: ENET_TXEN}
- {pin_num: F14, pin_signal: GPIO_AD_B0_09, label: ENET_RST, identifier: ENET_RST}
- {pin_num: G13, pin_signal: GPIO_AD_B0_10, label: INT1_COMBO, identifier: INT1_COMBO}
- {pin_num: D14, pin_signal: GPIO_B1_13, label: WDOG_B, identifier: WDOG_B}
- {pin_num: K7, pin_signal: PMIC_ON_REQ, label: PMIC_ON_REQ, identifier: PMIC_ON_REQ}
- {pin_num: J3, pin_signal: GPIO_SD_B0_01, label: SD1_CLK, identifier: SD1_CLK}
- {pin_num: J4, pin_signal: GPIO_SD_B0_00, label: SD1_CMD, identifier: SD1_CMD}
- {pin_num: J1, pin_signal: GPIO_SD_B0_02, label: SD1_D0, identifier: SD1_D0}
- {pin_num: K1, pin_signal: GPIO_SD_B0_03, label: SD1_D1, identifier: SD1_D1}
- {pin_num: H2, pin_signal: GPIO_SD_B0_04, label: SD1_D2, identifier: SD1_D2}
- {pin_num: J2, pin_signal: GPIO_SD_B0_05, label: SD1_D3, identifier: SD1_D3}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

