u-blox/evb-ant-1/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: L14, peripheral: LPUART1, signal: RX, pin_signal: GPIO_AD_B0_13, software_input_on: Disable, hysteresis_enable: Disable, pull_up_down_config: Pull_Down_100K_Ohm,
    pull_keeper_select: Keeper, pull_keeper_enable: Enable, open_drain: Disable, speed: MHZ_100, drive_strength: R0_6, slew_rate: Slow}
  - {pin_num: K14, peripheral: LPUART1, signal: TX, pin_signal: GPIO_AD_B0_12, software_input_on: Disable, hysteresis_enable: Disable, pull_up_down_config: Pull_Down_100K_Ohm,
    pull_keeper_select: Keeper, pull_keeper_enable: Enable, open_drain: Disable, speed: MHZ_100, drive_strength: R0_6, slew_rate: Slow}
  - {pin_num: A7, peripheral: ENET, signal: enet_mdc, pin_signal: GPIO_EMC_40, software_input_on: Disable, hysteresis_enable: Disable, pull_up_down_config: Pull_Up_100K_Ohm,
    pull_keeper_select: Pull, pull_keeper_enable: Enable, open_drain: Disable, speed: MHZ_200, drive_strength: R0_5, slew_rate: Fast}
  - {pin_num: C7, peripheral: ENET, signal: enet_mdio, pin_signal: GPIO_EMC_41, software_input_on: Disable, hysteresis_enable: Disable, pull_up_down_config: Pull_Up_100K_Ohm,
    pull_keeper_select: Pull, pull_keeper_enable: Enable, open_drain: Enable, speed: MHZ_50, drive_strength: R0_5, slew_rate: Fast}
  - {pin_num: B13, peripheral: ENET, signal: enet_ref_clk, pin_signal: GPIO_B1_10, software_input_on: Enable, hysteresis_enable: Disable, pull_up_down_config: Pull_Down_100K_Ohm,
    pull_keeper_select: Keeper, pull_keeper_enable: Disable, open_drain: Disable, speed: MHZ_50, drive_strength: R0_6, slew_rate: Fast}
  - {pin_num: E12, peripheral: ENET, signal: 'enet_rx_data, 0', pin_signal: GPIO_B1_04, software_input_on: Disable, hysteresis_enable: Disable, pull_up_down_config: Pull_Up_100K_Ohm,
    pull_keeper_select: Pull, pull_keeper_enable: Enable, open_drain: Disable, speed: MHZ_200, drive_strength: R0_5, slew_rate: Fast}
  - {pin_num: D12, peripheral: ENET, signal: 'enet_rx_data, 1', pin_signal: GPIO_B1_05, software_input_on: Disable, hysteresis_enable: Disable, pull_up_down_config: Pull_Up_100K_Ohm,
    pull_keeper_select: Pull, pull_keeper_enable: Enable, open_drain: Disable, speed: MHZ_200, drive_strength: R0_5, slew_rate: Fast}
  - {pin_num: C12, peripheral: ENET, signal: enet_rx_en, pin_signal: GPIO_B1_06, software_input_on: Disable, hysteresis_enable: Disable, pull_up_down_config: Pull_Up_100K_Ohm,
    pull_keeper_select: Pull, pull_keeper_enable: Enable, open_drain: Disable, speed: MHZ_200, drive_strength: R0_5, slew_rate: Fast}
  - {pin_num: C13, peripheral: ENET, signal: enet_rx_er, pin_signal: GPIO_B1_11, software_input_on: Disable, hysteresis_enable: Disable, pull_up_down_config: Pull_Up_100K_Ohm,
    pull_keeper_select: Pull, pull_keeper_enable: Enable, open_drain: Disable, speed: MHZ_200, drive_strength: R0_5, slew_rate: Fast}
  - {pin_num: B12, peripheral: ENET, signal: 'enet_tx_data, 0', pin_signal: GPIO_B1_07, software_input_on: Disable, hysteresis_enable: Disable, pull_up_down_config: Pull_Up_100K_Ohm,
    pull_keeper_select: Pull, pull_keeper_enable: Enable, open_drain: Disable, speed: MHZ_200, drive_strength: R0_5, slew_rate: Fast}
  - {pin_num: A12, peripheral: ENET, signal: 'enet_tx_data, 1', pin_signal: GPIO_B1_08, software_input_on: Disable, hysteresis_enable: Disable, pull_up_down_config: Pull_Up_100K_Ohm,
    pull_keeper_select: Pull, pull_keeper_enable: Enable, open_drain: Disable, speed: MHZ_200, drive_strength: R0_5, slew_rate: Fast}
  - {pin_num: A13, peripheral: ENET, signal: enet_tx_en, pin_signal: GPIO_B1_09, software_input_on: Disable, hysteresis_enable: Disable, pull_up_down_config: Pull_Up_100K_Ohm,
    pull_keeper_select: Pull, pull_keeper_enable: Enable, open_drain: Disable, speed: MHZ_200, drive_strength: R0_5, slew_rate: Fast}
  - {pin_num: F14, peripheral: GPIO1, signal: 'gpio_io, 09', pin_signal: GPIO_AD_B0_09, software_input_on: Disable, hysteresis_enable: Disable, pull_up_down_config: Pull_Up_100K_Ohm,
    pull_keeper_select: Pull, pull_keeper_enable: Enable, open_drain: Disable, speed: MHZ_100, drive_strength: R0_5, slew_rate: Fast}
  - {pin_num: J3, peripheral: USDHC1, signal: usdhc_clk, pin_signal: GPIO_SD_B0_01}
  - {pin_num: J4, peripheral: USDHC1, signal: usdhc_cmd, pin_signal: GPIO_SD_B0_00}
  - {pin_num: J1, peripheral: USDHC1, signal: 'usdhc_data, 0', pin_signal: GPIO_SD_B0_02}
  - {pin_num: K1, peripheral: USDHC1, signal: 'usdhc_data, 1', pin_signal: GPIO_SD_B0_03}
  - {pin_num: H2, peripheral: USDHC1, signal: 'usdhc_data, 2', pin_signal: GPIO_SD_B0_04}
  - {pin_num: J2, peripheral: USDHC1, signal: 'usdhc_data, 3', pin_signal: GPIO_SD_B0_05}
  - {pin_num: J11, peripheral: LPUART2, signal: CTS_B, pin_signal: GPIO_AD_B1_00, identifier: ANT_BXX_CTS}
  - {pin_num: K11, peripheral: LPUART2, signal: RTS_B, pin_signal: GPIO_AD_B1_01, identifier: ANT_BXX_RTS}
  - {pin_num: M12, peripheral: LPUART2, signal: RX, pin_signal: GPIO_AD_B1_03, identifier: ANT_BXX_RX}
  - {pin_num: L11, peripheral: LPUART2, signal: TX, pin_signal: GPIO_AD_B1_02, identifier: ANT_BXX_TX}
  - {pin_num: H12, peripheral: LPSPI3, signal: PCS0, pin_signal: GPIO_AD_B1_12, identifier: ANT_BXX_CS, direction: OUTPUT}
  - {pin_num: J14, peripheral: LPSPI3, signal: SCK, pin_signal: GPIO_AD_B1_15, identifier: ANT_BXX_CLK}
  - {pin_num: H11, peripheral: LPSPI3, signal: SDI, pin_signal: GPIO_AD_B1_13, identifier: ANT_BXX_MISO}
  - {pin_num: G12, peripheral: LPSPI3, signal: SDO, pin_signal: GPIO_AD_B1_14, identifier: ANT_BXX_MOSI}
  - {pin_num: M13, peripheral: GPIO1, signal: 'gpio_io, 25', pin_signal: GPIO_AD_B1_09, identifier: ANT_BXX_RST, direction: OUTPUT, gpio_init_state: 'true', pull_up_down_config: Pull_Up_47K_Ohm,
    open_drain: Enable}
  - {pin_num: D13, peripheral: GPIO7, signal: 'gpio_io, 28', pin_signal: GPIO_B1_12, identifier: ANT_BXX_SW1, direction: OUTPUT, gpio_init_state: 'true', pull_up_down_config: Pull_Up_47K_Ohm,
    open_drain: Enable}
  - {pin_num: M14, peripheral: GPIO1, signal: 'gpio_io, 00', pin_signal: GPIO_AD_B0_00, direction: OUTPUT, gpio_init_state: 'true', pull_up_down_config: Pull_Up_47K_Ohm,
    open_drain: Enable}
  - {pin_num: L13, peripheral: GPIO1, signal: 'gpio_io, 26', pin_signal: GPIO_AD_B1_10, identifier: ANT_BXX_GPIO1, direction: OUTPUT, open_drain: Enable}
  - {pin_num: J13, peripheral: GPIO1, signal: 'gpio_io, 27', pin_signal: GPIO_AD_B1_11, identifier: ANT_BXX_GPIO2, direction: OUTPUT, open_drain: Enable}
  - {pin_num: H13, peripheral: GPIO1, signal: 'gpio_io, 24', pin_signal: GPIO_AD_B1_08, identifier: ANT_BXX_GPIO3, direction: OUTPUT, open_drain: Enable}
  - {pin_num: C3, peripheral: GPIO3, signal: 'gpio_io, 22', pin_signal: GPIO_EMC_36, identifier: ANT_BXX_UART_MUX, direction: OUTPUT}
  - {pin_num: L5, peripheral: GPIO3, signal: 'gpio_io, 00', pin_signal: GPIO_SD_B1_00, identifier: MAYA_PDN, direction: OUTPUT}
  - {pin_num: F2, peripheral: GPIO4, signal: 'gpio_io, 04', pin_signal: GPIO_EMC_04, identifier: MAYA_BT_W_H, direction: INPUT}
  - {pin_num: C1, peripheral: GPIO4, signal: 'gpio_io, 21', pin_signal: GPIO_EMC_21, identifier: MAYA_BT_W_D, direction: OUTPUT}
  - {pin_num: A2, peripheral: GPIO4, signal: 'gpio_io, 27', pin_signal: GPIO_EMC_27, identifier: MAYA_BT_RESET, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: D1, peripheral: GPIO4, signal: 'gpio_io, 28', pin_signal: GPIO_EMC_28, identifier: MAYA_WLAN_W_H, direction: INPUT}
  - {pin_num: C2, peripheral: GPIO4, signal: 'gpio_io, 09', pin_signal: GPIO_EMC_09, identifier: MAYA_WLAN_W_D, direction: OUTPUT}
  - {pin_num: B2, peripheral: GPIO4, signal: 'gpio_io, 18', pin_signal: GPIO_EMC_18, identifier: MAYA_WLAN_RESET, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: D2, peripheral: LPUART6, signal: TX, pin_signal: GPIO_EMC_25, identifier: MAYA_TX}
  - {pin_num: B3, peripheral: LPUART6, signal: RX, pin_signal: GPIO_EMC_26, identifier: MAYA_RX}
  - {pin_num: E1, peripheral: LPUART6, signal: RTS_B, pin_signal: GPIO_EMC_29, identifier: MAYA_RTS}
  - {pin_num: C6, peripheral: LPUART6, signal: CTS_B, pin_signal: GPIO_EMC_30, identifier: MAYA_CTS}
  - {pin_num: B1, peripheral: LPUART3, signal: CTS_B, pin_signal: GPIO_EMC_15, identifier: NINA_CTS}
  - {pin_num: A5, peripheral: LPUART3, signal: RTS_B, pin_signal: GPIO_EMC_16, identifier: NINA_RTS}
  - {pin_num: B6, peripheral: LPUART3, signal: RX, pin_signal: GPIO_EMC_14, identifier: NINA_RX}
  - {pin_num: A6, peripheral: LPUART3, signal: TX, pin_signal: GPIO_EMC_13, identifier: NINA_TX}
  - {pin_num: F3, peripheral: LPSPI2, signal: PCS0, pin_signal: GPIO_EMC_01, identifier: NINA_CS}
  - {pin_num: E3, peripheral: LPSPI2, signal: SCK, pin_signal: GPIO_EMC_00, identifier: NINA_CLK}
  - {pin_num: G4, peripheral: GPIO4, signal: 'gpio_io, 03', pin_signal: GPIO_EMC_03, identifier: NINA_MISO, direction: INPUT, pull_keeper_enable: Enable}
  - {pin_num: F4, peripheral: GPIO4, signal: 'gpio_io, 02', pin_signal: GPIO_EMC_02, identifier: NINA_MOSI, direction: INPUT, pull_keeper_enable: Enable}
  - {pin_num: F1, peripheral: GPIO4, signal: 'gpio_io, 22', pin_signal: GPIO_EMC_22, identifier: NINA_RST, direction: OUTPUT, gpio_init_state: 'true', pull_up_down_config: Pull_Up_47K_Ohm,
    open_drain: Enable}
  - {pin_num: D3, peripheral: GPIO4, signal: 'gpio_io, 24', pin_signal: GPIO_EMC_24, identifier: NINA_SW1, direction: OUTPUT, gpio_init_state: 'true', pull_up_down_config: Pull_Up_47K_Ohm,
    open_drain: Enable}
  - {pin_num: C5, peripheral: GPIO4, signal: 'gpio_io, 31', pin_signal: GPIO_EMC_31, identifier: NINA_SW2, direction: OUTPUT, gpio_init_state: 'true', pull_up_down_config: Pull_Up_47K_Ohm,
    open_drain: Enable}
  - {pin_num: A4, peripheral: GPIO4, signal: 'gpio_io, 17', pin_signal: GPIO_EMC_17, identifier: NINA_GPIO1, direction: INPUT, pull_up_down_config: Pull_Up_47K_Ohm}
  - {pin_num: A3, peripheral: GPIO4, signal: 'gpio_io, 20', pin_signal: GPIO_EMC_20, identifier: NINA_GPIO2, direction: INPUT, pull_up_down_config: Pull_Up_47K_Ohm}
  - {pin_num: B4, peripheral: GPIO4, signal: 'gpio_io, 19', pin_signal: GPIO_EMC_19, identifier: NINA_GPIO3, direction: INPUT, pull_up_down_config: Pull_Up_47K_Ohm}
  - {pin_num: C4, peripheral: GPIO3, signal: 'gpio_io, 19', pin_signal: GPIO_EMC_33, identifier: NINA_UART_MUX, direction: OUTPUT}
  - {pin_num: B11, peripheral: GPIO7, signal: 'gpio_io, 17', pin_signal: GPIO_B1_01, identifier: MCU_SW1, direction: INPUT, software_input_on: Disable, pull_up_down_config: Pull_Up_47K_Ohm,
    pull_keeper_select: Pull}
  - {pin_num: C11, peripheral: GPIO7, signal: 'gpio_io, 18', pin_signal: GPIO_B1_02, identifier: MCU_SW2, direction: INPUT, software_input_on: Disable, pull_up_down_config: Pull_Up_47K_Ohm,
    pull_keeper_select: Pull}
  - {pin_num: C14, peripheral: GPIO7, signal: 'gpio_io, 30', pin_signal: GPIO_B1_14, identifier: MCU_SW3, direction: INPUT, software_input_on: Disable, pull_up_down_config: Pull_Up_47K_Ohm,
    pull_keeper_select: Pull}
  - {pin_num: A11, peripheral: GPIO2, signal: 'gpio_io, 16', pin_signal: GPIO_B1_00, identifier: USER_LED_01, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: B14, peripheral: GPIO2, signal: 'gpio_io, 31', pin_signal: GPIO_B1_15, identifier: USER_LED_02, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: L6, peripheral: GPIO5, signal: 'gpio_io, 00', pin_signal: WAKEUP, identifier: USER_BUTTON, direction: INPUT, pull_up_down_config: Pull_Up_47K_Ohm}
  - {pin_num: K7, peripheral: SNVS, signal: snvs_pmic_on_req, pin_signal: PMIC_ON_REQ}
  - {pin_num: D14, peripheral: WDOG1, signal: wdog_b, pin_signal: GPIO_B1_13}
  - {pin_num: G13, peripheral: GPIO1, signal: 'gpio_io, 10', pin_signal: GPIO_AD_B0_10, direction: INPUT, gpio_interrupt: kGPIO_IntFallingEdge, pull_up_down_config: Pull_Up_47K_Ohm,
    pull_keeper_select: Pull}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

