u-blox/evb-ant-1/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           
  CLOCK_EnableClock(kCLOCK_IomuxcSnvs);       

  /* GPIO configuration of ANT_BXX_SW2 on GPIO_AD_B0_00 (pin M14) */
  gpio_pin_config_t ANT_BXX_SW2_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B0_00 (pin M14) */
  GPIO_PinInit(GPIO1, 0U, &ANT_BXX_SW2_config);

  /* GPIO configuration of INT1_COMBO on GPIO_AD_B0_10 (pin G13) */
  gpio_pin_config_t INT1_COMBO_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_IntFallingEdge
  };
  /* Initialize GPIO functionality on GPIO_AD_B0_10 (pin G13) */
  GPIO_PinInit(GPIO1, 10U, &INT1_COMBO_config);
  /* Enable GPIO pin interrupt on GPIO_AD_B0_10 (pin G13) */
  GPIO_PortEnableInterrupts(GPIO1, 1U << 10U);

  /* GPIO configuration of ANT_BXX_GPIO3 on GPIO_AD_B1_08 (pin H13) */
  gpio_pin_config_t ANT_BXX_GPIO3_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_08 (pin H13) */
  GPIO_PinInit(GPIO1, 24U, &ANT_BXX_GPIO3_config);

  /* GPIO configuration of ANT_BXX_RST on GPIO_AD_B1_09 (pin M13) */
  gpio_pin_config_t ANT_BXX_RST_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_09 (pin M13) */
  GPIO_PinInit(GPIO1, 25U, &ANT_BXX_RST_config);

  /* GPIO configuration of ANT_BXX_GPIO1 on GPIO_AD_B1_10 (pin L13) */
  gpio_pin_config_t ANT_BXX_GPIO1_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_10 (pin L13) */
  GPIO_PinInit(GPIO1, 26U, &ANT_BXX_GPIO1_config);

  /* GPIO configuration of ANT_BXX_GPIO2 on GPIO_AD_B1_11 (pin J13) */
  gpio_pin_config_t ANT_BXX_GPIO2_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_11 (pin J13) */
  GPIO_PinInit(GPIO1, 27U, &ANT_BXX_GPIO2_config);

  /* GPIO configuration of USER_LED_01 on GPIO_B1_00 (pin A11) */
  gpio_pin_config_t USER_LED_01_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_00 (pin A11) */
  GPIO_PinInit(GPIO2, 16U, &USER_LED_01_config);

  /* GPIO configuration of USER_LED_02 on GPIO_B1_15 (pin B14) */
  gpio_pin_config_t USER_LED_02_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_15 (pin B14) */
  GPIO_PinInit(GPIO2, 31U, &USER_LED_02_config);

  /* GPIO configuration of MAYA_PDN on GPIO_SD_B1_00 (pin L5) */
  gpio_pin_config_t MAYA_PDN_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SD_B1_00 (pin L5) */
  GPIO_PinInit(GPIO3, 0U, &MAYA_PDN_config);

  /* GPIO configuration of NINA_UART_MUX on GPIO_EMC_33 (pin C4) */
  gpio_pin_config_t NINA_UART_MUX_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_33 (pin C4) */
  GPIO_PinInit(GPIO3, 19U, &NINA_UART_MUX_config);

  /* GPIO configuration of ANT_BXX_UART_MUX on GPIO_EMC_36 (pin C3) */
  gpio_pin_config_t ANT_BXX_UART_MUX_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_36 (pin C3) */
  GPIO_PinInit(GPIO3, 22U, &ANT_BXX_UART_MUX_config);

  /* GPIO configuration of NINA_MOSI on GPIO_EMC_02 (pin F4) */
  gpio_pin_config_t NINA_MOSI_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_02 (pin F4) */
  GPIO_PinInit(GPIO4, 2U, &NINA_MOSI_config);

  /* GPIO configuration of NINA_MISO on GPIO_EMC_03 (pin G4) */
  gpio_pin_config_t NINA_MISO_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_03 (pin G4) */
  GPIO_PinInit(GPIO4, 3U, &NINA_MISO_config);

  /* GPIO configuration of MAYA_BT_W_H on GPIO_EMC_04 (pin F2) */
  gpio_pin_config_t MAYA_BT_W_H_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_04 (pin F2) */
  GPIO_PinInit(GPIO4, 4U, &MAYA_BT_W_H_config);

  /* GPIO configuration of MAYA_WLAN_W_D on GPIO_EMC_09 (pin C2) */
  gpio_pin_config_t MAYA_WLAN_W_D_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_09 (pin C2) */
  GPIO_PinInit(GPIO4, 9U, &MAYA_WLAN_W_D_config);

  /* GPIO configuration of NINA_GPIO1 on GPIO_EMC_17 (pin A4) */
  gpio_pin_config_t NINA_GPIO1_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_17 (pin A4) */
  GPIO_PinInit(GPIO4, 17U, &NINA_GPIO1_config);

  /* GPIO configuration of MAYA_WLAN_RESET on GPIO_EMC_18 (pin B2) */
  gpio_pin_config_t MAYA_WLAN_RESET_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_18 (pin B2) */
  GPIO_PinInit(GPIO4, 18U, &MAYA_WLAN_RESET_config);

